[
  {
    "content": "Your heart is the size of an ocean. Go find yourself in its hidden depths.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "The Bay of Bengal is hit frequently by cyclones. The months of November and May, in particular, are dangerous in this regard.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Thinking is the capital, Enterprise is the way, Hard Work is the solution.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If You Can'T Make It Good, At Least Make It Look Good.",
    "author": "Bill Gates",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Heart be brave. If you cannot be brave, just go. Love's glory is not a small thing.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "It is bad for a young man to sin; but it is worse for an old man to sin.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If You Are Out To Describe The Truth, Leave Elegance To The Tailor.",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "O man you are busy working for the world, and the world is busy trying to turn you out.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "While children are struggling to be unique, the world around them is trying all means to make them look like everybody else.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "These Capitalists Generally Act Harmoniously And In Concert, To Fleece The People.",
    "author": "Abraham Lincoln",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Don'T Believe In Failure. It Is Not Failure If You Enjoyed The Process.",
    "author": "Oprah Winfrey",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Do not get elated at any victory, for all such victory is subject to the will of God.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Wear gratitude like a cloak and it will feed every corner of your life.",
    "author": "Rumi",
    "tags": [
      "life"
    ]
  },
  {
    "content": "If you even dream of beating me you'd better wake up and apologize.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "I Will Praise Any Man That Will Praise Me.",
    "author": "William Shakespeare",
    "tags": [
      "general"
    ]
  },
  {
    "content": "One Of The Greatest Diseases Is To Be Nobody To Anybody.",
    "author": "Mother Teresa",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I'm so fast that last night I turned off the light switch in my hotel room and was in bed before the room was dark.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "People Must Learn To Hate And If They Can Learn To Hate, They Can Be Taught To Love.",
    "author": "Nelson Mandela",
    "tags": [
      "love",
      "wisdom"
    ]
  },
  {
    "content": "Everyone has been made for some particular work, and the desire for that work has been put in every heart.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "The less of the World, the freer you live.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Respond to every call that excites your spirit.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Way To Get Started Is To Quit Talking And Begin Doing.",
    "author": "Walt Disney",
    "tags": [
      "general"
    ]
  },
  {
    "content": "God Doesn'T Require Us To Succeed, He Only Requires That You Try.",
    "author": "Mother Teresa",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Speak any language, Turkish, Greek, Persian, Arabic, but always speak with love.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Happiness comes towards those which believe in him.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Knowledge is of two kinds: that which is absorbed and that which is heard. And that which is heard does not profit if it is not absorbed.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "When I am silent, I have thunder hidden inside.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Technological Progress Is Like An Axe In The Hands Of A Pathological Criminal.",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "No One Would Choose A Friendless Existence On Condition Of Having All The Other Things In The World.",
    "author": "Aristotle",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Life is a gamble. You can get hurt, but people die in plane crashes, lose their arms and legs in car accidents; people die every day. Same with fighters: some die, some get hurt, some go on. You just don't let yourself believe it will happen to you.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational",
      "life"
    ]
  },
  {
    "content": "The End Of Life Is To Be Like God, And The Soul Following God Will Be Like Him.",
    "author": "Socrates",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Let us sacrifice our today so that our children can have a better tomorrow.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Your task is not to seek for love, but merely to seek and find all the barriers within yourself that you have built against it.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "In every religion there is love, yet love has no religion.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Everything in the universe is within you. Ask all from yourself.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I'm not a handsome guy, but I can give my hand to someone who needs help. Beauty is in the heart, not in the face.",
    "author": "Abdul Kalam",
    "tags": [
      "love"
    ]
  },
  {
    "content": "What Do I Wear In Bed? Why, Chanel No. 5, Of Course.",
    "author": "Marilyn Monroe",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A Good Head And A Good Heart Are Always A Formidable Combination.",
    "author": "Nelson Mandela",
    "tags": [
      "love"
    ]
  },
  {
    "content": "The Soul Never Thinks Without A Picture.",
    "author": "Aristotle",
    "tags": [
      "general"
    ]
  },
  {
    "content": "In your light I learn how to love. In your beauty, how to make poems. You dance inside my chest where no-one sees you, but sometimes I do, and that sight becomes this art.",
    "author": "Rumi",
    "tags": [
      "love",
      "wisdom"
    ]
  },
  {
    "content": "Let the beauty we love be what we do. There are hundreds of ways to kneel and kiss the ground.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "If You Like Your Brother And He'S Prospering, You'Ll Be Pleased For Him.",
    "author": "Hamad Bin Isa Al Khalifa",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Success Is Dependent Upon The Glands - Sweat Glands.",
    "author": "Zig Ziglar",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Champions are not generated from the championship. Champion is generated from something they have in them, desires, dreams, and visions.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "No matter what is the environment around you, it is always possible to maintain your brand of integrity.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Applause Waits On Success.",
    "author": "Benjamin Franklin",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Just As Courage Imperils Life, Fear Protects It.",
    "author": "Leonardo Da Vinci",
    "tags": [
      "inspirational",
      "life"
    ]
  },
  {
    "content": "It'S Better To Be A Lion For A Day Than A Sheep All Your Life.",
    "author": "Elizabeth Kenny",
    "tags": [
      "life"
    ]
  },
  {
    "content": "The Devil'S Voice Is Sweet To Hear.",
    "author": "Stephen King",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Sometimes the people with the worst past, create the best future.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Every day, nay every moment, try to do some good deed.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "No Matter What People Tell You, Words And Ideas Can Change The World.",
    "author": "Robin Williams",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Champions have to have the skill and the will. But the will must be stronger than the skill.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Men Occasionally Stumble Over The Truth, But Most Of Them Pick Themselves Up And Hurry Off As If Nothing Had Happened.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Goodbyes are only for those who love with their eyes. Because for those who love with heart and soul there is no such thing as separation.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "The best revenge is to improve yourself.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "God gave me this illness to remind me that I'm not Number One; He is.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Success Is A Personal Standard, Reaching For The Highest That Is In Us, Becoming All That We Can Be.",
    "author": "Zig Ziglar",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "When You Have Really Exhausted An Experience You Always Reverence And Love It.",
    "author": "Albert Camus",
    "tags": [
      "life",
      "love"
    ]
  },
  {
    "content": "Now you see me, now you don't. George thinks he will, but I know he won't!",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Elegance Does Not Consist In Putting On A New Dress.",
    "author": "Coco Chanel",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Is Always Consoling To Think Of Suicide: In That Way One Gets Through Many A Bad Night.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Eating Words Has Never Given Me Indigestion.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "India has to be transformed into a developed nation, a prosperous nation and a healthy nation, with a value system.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It's not bragging if you can back it up.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Wish People Would Love Everybody Else The Way They Love Me. It Would Be A Better World.",
    "author": "Muhammad Ali",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Why do I want my wife to show off her panties when the wind blows? Horses show their behinds, and cows and mules, not humans.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Words Are Only Painted Fire; A Look Is The Fire Itself.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Words, Without Power, Is Mere Philosophy.",
    "author": "Muhammad Iqbal",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The cure for pain is in the pain.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Whatever happens, just keep smiling and lose yourself in Love.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Do The Right Thing. It Will Gratify Some People And Astonish The Rest.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Only the soul knows what love is.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Earning of livelihood by following some profession is better than living on charity.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Burdens are the foundations of ease and bitter things the forerunners of pleasure.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Too Many Have Dispensed With Generosity In Order To Practice Charity.",
    "author": "Albert Camus",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Even the greatest was once a beginner. Don't be afraid to take that first step.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "No Great Intellectual Thing Was Ever Done By Great Effort.",
    "author": "Theodore Roosevelt",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To fight against one's desires is the greatest of all fights.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Innovation Distinguishes Between A Leader And A Follower.",
    "author": "Steve Jobs",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We Enjoy The Process Far More Than The Proceeds.",
    "author": "Warren Buffett",
    "tags": [
      "general"
    ]
  },
  {
    "content": "When I Started Counting My Blessings, My Whole Life Turned Around.",
    "author": "Willie Nelson",
    "tags": [
      "life"
    ]
  },
  {
    "content": "This being human is a guest house. Every morning a new arrival. Welcome and entertain them all!",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All My Life I'Ve Looked At Words As Though I Were Seeing Them For The First Time.",
    "author": "Ernest Hemingway",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Waiting Is Painful. Forgetting Is Painful. But Not Knowing Which To Do Is The Worse Kind Of Suffering.",
    "author": "Paulo Coelho",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Never Allow Someone To Be Your Priority While Allowing Yourself To Be Their Option.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To Jaw-Jaw Is Always Better Than To War-War.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "That'S The Real Trouble With The World, Too Many People Grow Up",
    "author": "Walt Disney",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Is Easier To Stay Out Than Get Out.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The worst man is the one who sees himself as the best.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The World Breaks Everyone, And Afterward, Some Are Strong At The Broken Places.",
    "author": "Ernest Hemingway",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Rule No.1: Never Lose Money. Rule No.2: Never Forget Rule No.1.",
    "author": "Warren Buffett",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Convergence of our views on global trade issues under the WTO and our common resolve to combat terrorism provide a valuable base for mutual understanding.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Whenever You Find Yourself On The Side Of The Majority, It Is Time To Pause And Reflect.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Whatever Is Done For Love Always Occurs Beyond Good And Evil.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Things Should Be Made As Simple As Possible, But Not Any Simpler.",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Stop acting so small. You are the universe in ecstatic motion.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All Truth Is Simple... Is That Not Doubly A Lie?",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Money Is Only A Tool. It Will Take You Wherever You Wish, But It Will Not Replace You As The Driver.",
    "author": "Ayn Rand",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The fight is won or lost far away from witnesses - behind the lines, in the gym, and out there on the road, long before I dance under those lights.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who avoids complaint invites happiness.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We are the mirror - As well as the face in it.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Yesterday I was clever, so I wanted to change the world. Today I am wise, so I am changing myself.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "For 2,500 years, India has never invaded anybody.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If Past History Was All There Was To The Game, The Richest People Would Be Librarians.",
    "author": "Warren Buffett",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Your souls are precious and can only be equal to the price of Paradise, therefore sell them only at that price.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A Wise Man Can Learn More From A Foolish Question Than A Fool Can Learn From A Wise Answer.",
    "author": "Bruce Lee",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "If Allah wants for a people ill, he gives them debates and takes away from them actions.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who builds a masjid in the way of Allah, God will build a house for him in the paradise.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Love Is Blind; Friendship Closes Its Eyes.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Don'T Go Around Saying The World Owes You A Living. The World Owes You Nothing. It Was Here First.",
    "author": "Mark Twain",
    "tags": [
      "life"
    ]
  },
  {
    "content": "An alert and learned man will take advice from any event.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "I don't count my sit-ups. I only start counting when it starts hurting. When I feel pain, that's when I start counting, because that's when it really counts.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The wound is the place where the Light enters you.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Luxury is an obstacle, and so is the fatness of the body.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Come, come, whoever you are. Wanderer, worshiper, lover of leaving. It doesn't matter. Ours is not a caravan of despair. come, even if you have broken your vows a thousand times. Come, yet again, come, come.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "The Golden Age Is Before Us, Not Behind Us.",
    "author": "William Shakespeare",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Fiction Is The Truth Inside The Lie.",
    "author": "Stephen King",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Believe You Can And You'Re Halfway There.",
    "author": "Theodore Roosevelt",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "All The Great Things Are Simple, And Many Can Be Expressed In A Single Word: Freedom, Justice, Honor, Duty, Mercy, Hope.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Allah's the Arabic term for God. Stand up for God, fight for God, work for God and do the right thing, and go the right way, things will end up in your corner.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Anger Is Never Without A Reason, But Seldom With A Good One.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Good Actions Are A Guard Against The Blows Of Adversity.",
    "author": "Abu Bakr",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Use the same measure for selling that you use for purchasing.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Secret Of Getting Ahead Is Getting Started",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Don'T Know The Key To Success, But The Key To Failure Is Trying To Please Everybody.",
    "author": "Bill Cosby",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Real Loss Is Only Possible When You Love Something More Than You Love Yourself.",
    "author": "Robin Williams",
    "tags": [
      "love"
    ]
  },
  {
    "content": "This Is The First Convention Of The Space Age - Where A Candidate Can Promise The Moon And Mean It.",
    "author": "David Brinkley",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Don'T Like That Man. I Must Get To Know Him Better.",
    "author": "Abraham Lincoln",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To Shipbrokers, Coal Was Black Gold.",
    "author": "Roald Dahl",
    "tags": [
      "general"
    ]
  },
  {
    "content": "History, Despite Its Wrenching Pain, Cannot Be Unlived, But If Faced With Courage, Need Not Be Lived Again.",
    "author": "Maya Angelou",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Everyone who is taken by death asks for more time, while everyone who still has time makes excuses for procrastination.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I wonder at a man who loses hope of salvation when the door of repentance is open for him.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't count the days, make the days count.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Close your eyes, fall in Love, stay there.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "I Guess I Don'T So Much Mind Being Old, As I Mind Being Fat And Old.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It will be a killer, and a chiller, and a thriller, when I get the gorilla in Manila.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Dream Of An Africa Which Is In Peace With Itself.",
    "author": "Nelson Mandela",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "The Difference Between A Mountain And A Molehill Is Your Perspective.",
    "author": "Al Neuharth",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Am Certainly Not One Of Those Who Need To Be Prodded. In Fact, If Anything, I Am The Prod.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To the people that have said I'm too small, I'm not fast enough, I don't have what it takes, I'm not strong enough. THANK YOU.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There is a King Who is aware of every Mask you put on.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Be patient; patience is a pillar of faith.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Very Ink With Which History Is Written Is Merely Fluid Prejudice.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I was the first one in the gym, and the last one to leave.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Art Is The Proper Task Of Life.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "life"
    ]
  },
  {
    "content": "The Roots Of Education Are Bitter, But The Fruit Is Sweet.",
    "author": "Aristotle",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "Run away from greatness and greatness will follow you.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You may learn to imitate a birdcall, but do you experience what the nightingale feels for the rose?",
    "author": "Rumi",
    "tags": [
      "life",
      "wisdom"
    ]
  },
  {
    "content": "Bad Men Are Full Of Repentance.",
    "author": "Aristotle",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Blessed is he whose own faults keep him from seeing the faults of others.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The most helpless person is the one who is helpless in reforming himself.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who fears to weep, should learn to be kind to those who weep.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "My wealth is in my knowledge of self, love, and spirituality.",
    "author": "Muhammad Ali",
    "tags": [
      "love",
      "wisdom"
    ]
  },
  {
    "content": "He who aspires to paradise should learn to deal with people with kindness.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "All God's creatures are His family; and he is the most beloved of God who tries to do most good to God's creatures.",
    "author": "Abdul Kalam",
    "tags": [
      "love"
    ]
  },
  {
    "content": "When I Do Good, I Feel Good. When I Do Bad, I Feel Bad. That'S My Religion.",
    "author": "Abraham Lincoln",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Women are not equal with men, that's sure. When the woman is in danger she always looks to the man for help. We are superior by nature. The black or white woman needn't worry in life because the world is ruled by the white man.",
    "author": "Muhammad Ali",
    "tags": [
      "life"
    ]
  },
  {
    "content": "If you love someone, you are always joined with them - in joy, in absence, in solitude, in strife.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "I Am A Deeply Religious Nonbeliever - This Is A Somewhat New Kind Of Religion.",
    "author": "Albert Einstein",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "It Is The Supreme Art Of The Teacher To Awaken Joy In Creative Expression And Knowledge.",
    "author": "Albert Einstein",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "The best companion and helper is admirable morals.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Man Will Do Many Things To Get Himself Loved, He Will Do All Things To Get Himself Envied.",
    "author": "Mark Twain",
    "tags": [
      "love"
    ]
  },
  {
    "content": "When you seek advice, do not withhold any facts from the person whose advice you seek.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I have never regretted my silence. As for my speech, I have regretted it over and over again.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't read success stories, you will only get a message. Read failure stories, you will get some ideas to get success.",
    "author": "Abdul Kalam",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "I Have Nothing To Offer But Blood, Toil, Tears And Sweat.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I died as a mineral and became a plant, I died as a plant and rose to animal, I died as an animal and I was Man. Why should I fear? When was I less by dying?",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All Men'S Souls Are Immortal, But The Souls Of The Righteous Are Immortal And Divine.",
    "author": "Socrates",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Abstinence from sins is better than seeking help afterwards.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Inside the Great Mystery that is, we don't really own anything. What is this competition we feel then, before we go, one at a time, through the same gate?",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The only lasting beauty is the beauty of the heart.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Change Your Opinions, Keep To Your Principles; Change Your Leaves, Keep Intact Your Roots.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Many Marriages Would Be Better If The Husband And The Wife Clearly Understood That They Are On The Same Side.",
    "author": "Zig Ziglar",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Strong And Bitter Words Indicate A Weak Cause.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A man who views the world the same at fifty as he did at twenty has wasted thirty years of his life.",
    "author": "Muhammad Ali",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Give up to grace. The ocean takes care of each wave 'til it gets to shore. You need more help than you know.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Superior Man Acts Before He Speaks, And Afterwards Speaks According To His Action.",
    "author": "Confucius",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We'Re Getting Hurt, But I'M A Long-Term Investor.",
    "author": "Al Waleed Bin Talal",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Recitation of the Qur'an without contemplation and thought is futile.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Success is not achieved by winning all the time. Real success comes when we rise after we fall. Some mountains are higher than others. Some roads steeper than the next. There are hardships and setbacks but you cannot let them stop you. Even on the steepest road you must not turn back.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "A Riot Is The Language Of The Unheard.",
    "author": "Martin Luther King, Jr.",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Law Is Reason, Free From Passion.",
    "author": "Aristotle",
    "tags": [
      "love"
    ]
  },
  {
    "content": "The people who abandon Jihad fall a victim to humility and degradation.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We are all born with a divine fire in us. Our efforts should be to give wings to this fire and fill the world with the glow of its goodness.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Woman Was God'S Second Mistake.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All black Americans have slave names. They have white names; names that the slave master has given to them.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I'm most proud of my family.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "And you? When will you begin that long journey into yourself?",
    "author": "Rumi",
    "tags": [
      "life"
    ]
  },
  {
    "content": "How many lessons there are and how little they are taken.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The best way to make your dreams come true is to wake up.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "What One Writer Can Make In The Solitude Of One Room Is Something No Power Can Easily Destroy.",
    "author": "Salman Rushdie",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If There Is Something To Pardon In Everything, There Is Also Something To Condemn.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "At Home I Am A Nice Guy: But I Don'T Want The World To Know. Humble People, I'Ve Found, Don'T Get Very Far.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "No amount of guilt can change the past and no amount of worrying can change the future.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Not the ones speaking the same language, but the ones sharing the same feeling understand each other.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Is Better To Deserve Honors And Not Have Them Than To Have Them And Not Deserve Them.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Success Is A Lousy Teacher. It Seduces Smart People Into Thinking They Can'T Lose.",
    "author": "Bill Gates",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Cursed is the man who dies, but the evil done by him survives.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Quality, Not The Longevity, Of One'S Life Is What Is Important.",
    "author": "Martin Luther King, Jr.",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Age is whatever you think it is. You are as old as you think you are.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Derivatives Are Financial Weapons Of Mass Destruction.",
    "author": "Warren Buffett",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't you know yet? It is your Light that lights the worlds.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Hold on to your Salah, because if you lose that, you will lose everything else.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I am not this hair. I am not this skin. I am the soul that lives within.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Be Faithful In Small Things Because It Is In Them That Your Strength Lies.",
    "author": "Mother Teresa",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who sleeps without offering the night prayer, may he never enjoy a sound sleep.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Was Influenced A Lot By Those Around Me - There Was A Lot Of Singing That Went On In The Cotton Fields.",
    "author": "Willie Nelson",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Greed is permanent slavery.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Everything That We See Is A Shadow Cast By That Which We Do Not See.",
    "author": "Martin Luther King, Jr.",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To The Master'S Honor All Must Turn, Each In Its Track, Without A Sound, Forever Tracing Newton'S Ground.",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Women are the field that produces our nation. And if you can't protect your women, you can't protect your nation.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To Give Victory To The Right, Not Bloody Bullets, But Peaceful Ballots Only, Are Necessary.",
    "author": "Abraham Lincoln",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Ache For Home Lives In All Of Us, The Safe Place Where We Can Go As We Are And Not Be Questioned.",
    "author": "Maya Angelou",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You Were Born To Win, But To Be A Winner, You Must Plan To Win, Prepare To Win, And Expect To Win.",
    "author": "Zig Ziglar",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Education Is What Remains After One Has Forgotten What One Has Learned In School.",
    "author": "Albert Einstein",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "I'll tell you how I'd like to be remembered: As a black man who won the heavyweight title - Who has humorous and who never looked down on those who looked up to him - A man who stood for freedom, justice and equality - And I wouldn't even mind if folks forgot how pretty I was.",
    "author": "Muhammad Ali",
    "tags": [
      "humor"
    ]
  },
  {
    "content": "Tolerance and understanding won't 'trickle down' in our society any more than wealth does.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Does Not Do To Dwell On Dreams And Forget To Live.",
    "author": "J. K. Rowling",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Courtesy costs nothing, but buys everything.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If patience and gratitude had been she camels, it would have mattered little on which I rode.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Success Consists Of Going From Failure To Failure Without Loss Of Enthusiasm.",
    "author": "Winston Churchill",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "When you advise any person you should be guided by the fear of God.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A Candle never Loses any of its Light while Lighting up another candle.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "What Can You Do To Promote World Peace? Go Home And Love Your Family.",
    "author": "Mother Teresa",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Love Is The Only Force Capable Of Transforming An Enemy Into Friend.",
    "author": "Martin Luther King  Jr.",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Children make you want to start life over.",
    "author": "Muhammad Ali",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Our Scientific Power Has Outrun Our Spiritual Power. We Have Guided Missiles And Misguided Men.",
    "author": "Martin Luther King, Jr.",
    "tags": [
      "general"
    ]
  },
  {
    "content": "After Coming Into Contact With A Religious Man I Always Feel I Must Wash My Hands.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Am The Greatest, I Said That Even Before I Knew I Was.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who went to the kings to seek favors went away from Allah.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Oh writer! An Angel watches over all you write. Make your writing meaningful for it will eventually return to you and you will be questioned about what you wrote.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Speak a new language so that the world will be a new world.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The sweetness of life lies in dispensing with formalities.",
    "author": "Muhammad Ali",
    "tags": [
      "life"
    ]
  },
  {
    "content": "O Love, O pure deep Love, be here, be now, be all...",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "I Never Did A Day'S Work In My Life. It Was All Fun.",
    "author": "Thomas A. Edison",
    "tags": [
      "life"
    ]
  },
  {
    "content": "We have not invaded anyone. We have not conquered anyone. We have not grabbed their land, their culture, their history and tried to enforce our way of life on them.",
    "author": "Abdul Kalam",
    "tags": [
      "life"
    ]
  },
  {
    "content": "I have been a seeker and I still am, but I stopped asking the books and the stars. I started listening to the teaching of my Soul.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Be active! Take on responsibility! Work for the things you believe in. If you do not, you are surrendering your fate to others.",
    "author": "Abdul Kalam",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Don'T Tell Fish Stories Where The People Know You; But Particularly, Don'T Tell Them Where They Know The Fish.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Developing nations want to become developed nations.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We are born of love. Love is our mother.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "I Just Feel Happy To Be In America, Like I Said, It'S The Most Beautiful Country In The World.",
    "author": "Ahmed Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do for this life as if you live forever, do for the afterlife as if you will die tomorrow.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "life"
    ]
  },
  {
    "content": "You Know You Are On The Road To Success If You Would Do Your Job, And Not Be Paid For It.",
    "author": "Oprah Winfrey",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "A Compliment Is Something Like A Kiss Through A Veil.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Last night I had a dream. When I got to Africa, I had one hell of a rumble. I had to beat Tarzan's behind first, for claiming to be King of the Jungle.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "I Have Found The Paradox, That If You Love Until It Hurts, There Can Be No More Hurt, Only More Love.",
    "author": "Mother Teresa",
    "tags": [
      "love"
    ]
  },
  {
    "content": "After Climbing A Great Hill, One Only Finds That There Are Many More Hills To Climb.",
    "author": "Nelson Mandela",
    "tags": [
      "general"
    ]
  },
  {
    "content": "An Explanation Of Cause Is Not A Justification By Reason.",
    "author": "C. S. Lewis",
    "tags": [
      "general"
    ]
  },
  {
    "content": "His hands can't hit what his eyes can't see.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Life Loves The Liver Of It.",
    "author": "Maya Angelou",
    "tags": [
      "life",
      "love"
    ]
  },
  {
    "content": "Light up the fire of love inside and blaze the thoughts away.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Don't sit and wait. Get out there, feel life. Touch the sun, and immerse in the sea.",
    "author": "Rumi",
    "tags": [
      "life"
    ]
  },
  {
    "content": "There is a way between voice and presence, where information flows. In disciplined silence it opens; with wandering talk it closes.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Strength Does Not Come From Physical Capacity. It Comes From An Indomitable Will.",
    "author": "Mahatma Gandhi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "This life is not real. I conquered the world and it did not bring me satisfaction.",
    "author": "Muhammad Ali",
    "tags": [
      "life"
    ]
  },
  {
    "content": "It'S Fine To Celebrate Success But It Is More Important To Heed The Lessons Of Failure.",
    "author": "Bill Gates",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Stubbornness destroys good advice.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "My definition of evil is unfriendliness.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Climbing to the top demands strength, whether it is to the top of Mount Everest or to the top of your career.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Pray, And Let God Worry.",
    "author": "Martin Luther",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Miracles Do Not, In Fact, Break The Laws Of Nature.",
    "author": "C. S. Lewis",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There is no greater wealth than wisdom, no greater poverty than ignorance; no greater heritage than culture and no greater support than consultation.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "We Are What We Believe We Are.",
    "author": "C. S. Lewis",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "I Feel Much Freer Now That I Am Certain The Pope Is The Antichrist.",
    "author": "Martin Luther",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Darkness Cannot Drive Out Darkness; Only Light Can Do That. Hate Cannot Drive Out Hate; Only Love Can Do That.",
    "author": "Martin Luther King  Jr.",
    "tags": [
      "love"
    ]
  },
  {
    "content": "A developed India by 2020, or even earlier, is not a dream. It need not be a mere vision in the minds of many Indians. It is a mission we can all take up - and succeed.",
    "author": "Abdul Kalam",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "As To The Mental Essence, We Find It In Infants Devoid Of Every Mental Form.",
    "author": "Avicenna",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Let not your love become attachment, nor your hate become destruction.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "love"
    ]
  },
  {
    "content": "He Is Winding The Watch Of His Wit; By And By It Will Strike.",
    "author": "William Shakespeare",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't be sad! Because God sends hope in the most desperate moments. Don't forget, the heaviest rain comes out of the darkest clouds.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There Cannot Be A God Because If There Were One, I Could Not Believe That I Was Not He.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Don't get lost in your pain, know that one day your pain will become your cure.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Silence gives answers.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A Man Who Won'T Die For Something Is Not Fit To Live.",
    "author": "Martin Luther King, Jr.",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Solitude is better than the society of evil persons.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Only Real Progress Lies In Learning To Be Wrong All Alone.",
    "author": "Albert Camus",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "Drink! For You Know Not Whence You Came Nor Why: Drink! For You Know Not Why You Go, Nor Where.",
    "author": "Omar Khayyam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Shall The Effect Of This Good Lesson Keeps As Watchman To My Heart.",
    "author": "William Shakespeare",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Vanity prevents improvement.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Every Day, Nay Every Moment, Try To Do Some Good Deed.",
    "author": "Abu Bakr",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Money cannot help lifting its head.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To Think Of Shadows Is A Serious Thing.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If We Really Want To Love We Must Learn How To Forgive.",
    "author": "Mother Teresa",
    "tags": [
      "love",
      "wisdom"
    ]
  },
  {
    "content": "Music Expresses That Which Cannot Be Put Into Words.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Love Is A Fruit In Season At All Times, And Within Reach Of Every Hand.",
    "author": "Mother Teresa",
    "tags": [
      "love"
    ]
  },
  {
    "content": "To be able to give away riches is mandatory if you wish to possess them. This is the only way that you will be truly rich.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We Continue To Shape Our Personality All Our Life. If We Knew Ourselves Perfectly, We Should Die.",
    "author": "Albert Camus",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Your longing for ME is my message to you, All your attempts to reach ME, Are in reality MY attempts to reach you.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If you are greeted then return the greetings more warmly. If you are favored, then repay the obligation manifold; but he who takes the initiative will always excel in merit.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You have to keep breaking your heart until it opens.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Prejudice comes from being in the dark; sunlight disinfects it.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Never Put Off Till Tomorrow What You Can Do The Day After Tomorrow.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Nothing hurts a good soul and kind heart more than to live amongst people who can't understand it.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Hope Is The Dream Of A Waking Man.",
    "author": "Aristotle",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "We Make A Living By What We Get, But We Make A Life By What We Give.",
    "author": "Winston Churchill",
    "tags": [
      "life"
    ]
  },
  {
    "content": "I am so mad with love that mad men say to me - be still!",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "If you only say one prayer in a day make it Thank You.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Life'S Most Persistent And Urgent Question Is, 'What Are You Doing For Others?'",
    "author": "Martin Luther King  Jr.",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Confidence and hard work is the best medicine to kill the disease called failure. It will make you successful person.",
    "author": "Abdul Kalam",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "The bird is powered by its own life and by its motivation.",
    "author": "Abdul Kalam",
    "tags": [
      "inspirational",
      "life"
    ]
  },
  {
    "content": "Allah's Generosity is connected to gratitude, and gratitude is linked to increase in His generosity. The generosity of Allah will not stop increasing unless the gratitude of the servant ceases.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Bear sorrows and calamities patiently, otherwise you will never be happy.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "One lesson that every nation can learn from China is to focus more on creating village-level enterprises, quality health services and educational facilities.",
    "author": "Abdul Kalam",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "Like Slavery And Apartheid, Poverty Is Not Natural. It Is Man-Made And It Can Be Overcome And Eradicated By The Actions Of Human Beings.",
    "author": "Nelson Mandela",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Never Do Anything Against Conscience Even If The State Demands It.",
    "author": "Albert Einstein",
    "tags": [
      "technology"
    ]
  },
  {
    "content": "When you feel a peaceful joy, that's when you are near truth.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I grow silent. Dear soul, you speak.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All wars signify the failure of conflict resolution mechanisms, and they need post-war rebuilding of faith, trust and confidence.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "What you're thinking is what you're becoming.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Paint Self-Portraits Because I Am So Often Alone, Because I Am The Person I Know Best.",
    "author": "Frida Kahlo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "In Music The Passions Enjoy Themselves.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "love"
    ]
  },
  {
    "content": "That's how you came here, like a star without a name. Move across the night sky with those anonymous lights.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Your light is more magnificent than sunrise or sunset.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "No One Has Ever Become Poor By Giving.",
    "author": "Anne Frank",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Whatever pearl you seek, look for the pearl within the pearl!",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "India should walk on her own shadow - we must have our own development model.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You have escaped the cage. Your wings are stretched out. Now fly.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Work As If You Were To Live A Hundred Years. Pray As If You Were To Die Tomorrow.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Whenever you are alone, remind yourself that God has sent everyone else away so that there is only you and Him.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "When a man puts me a question, I judge of his intelligence.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There Has Never Yet Been A Man In Our History Who Led A Life Of Ease Whose Name Is Worth Remembering.",
    "author": "Theodore Roosevelt",
    "tags": [
      "life"
    ]
  },
  {
    "content": "A teacher should have a creative mind.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The criterion of action is that todays work should not be deferred till the following day.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Friendship is the hardest thing in the world to explain. It's not something you learn in school. But if you haven't learned the meaning of friendship, you really haven't learned anything.",
    "author": "Muhammad Ali",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "The chess master says nothing, other than moving the silent chess piece.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Reader, Suppose You Were An Idiot. And Suppose You Were A Member Of Congress. But I Repeat Myself.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Love Sleep. My Life Has The Tendency To Fall Apart When I'M Awake, You Know?",
    "author": "Ernest Hemingway",
    "tags": [
      "life",
      "love"
    ]
  },
  {
    "content": "He That Can Have Patience Can Have What He Will.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Champions Keep Playing Until They Get It Right.",
    "author": "Billie Jean King",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Without Music, Life Would Be A Mistake.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "life"
    ]
  },
  {
    "content": "The worst of our faults is our interest in other people's faults.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Think It'S Nice For Women To Try To Be Sexy For Their Man.",
    "author": "Salma Hayek",
    "tags": [
      "general"
    ]
  },
  {
    "content": "My impression of the American people can be summarized by a quotation from Benjamin Franklin, Those things that hurt instruct! I realized that people in this part of the world meet their problems head on. They attempt to get out of them rather than suffer them.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Boys, You Must Strive To Find Your Own Voice, Because The Longer You Wait To Begin The Less Likely You Are To Find It At All.",
    "author": "Robin Williams",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Be dignified, honest and truthful.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Women are not a garment you wear and undress however you like. They are honored and have their rights.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Love Matches, So Called, Have Illusion For Their Father And Need For Their Mother.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "love"
    ]
  },
  {
    "content": "A Lot Of People Quit Looking For Work As Soon As They Find A Job.",
    "author": "Zig Ziglar",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If We Open A Quarrel Between Past And Present, We Shall Find That We Have Lost The Future.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Even If I Knew That Tomorrow The World Would Go To Pieces, I Would Still Plant My Apple Tree.",
    "author": "Martin Luther",
    "tags": [
      "general"
    ]
  },
  {
    "content": "One who rushes madly after inordinate desire, runs the risk of encountering destruction and death.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Getting Over A Painful Experience Is Much Like Crossing Monkey Bars. You Have To Let Go At Some Point In Order To Move Forward.",
    "author": "C. S. Lewis",
    "tags": [
      "life"
    ]
  },
  {
    "content": "You Have Enemies? Good. That Means You'Ve Stood Up For Something, Sometime In Your Life.",
    "author": "Winston Churchill",
    "tags": [
      "life"
    ]
  },
  {
    "content": "It's the repetition of affirmations that leads to belief. And once that belief becomes a deep conviction, things begin to happen.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If I Were Not A Physicist, I Would Probably Be A Musician. I Often Think In Music. I Live My Daydreams In Music. I See My Life In Terms Of Music.",
    "author": "Albert Einstein",
    "tags": [
      "inspirational",
      "life"
    ]
  },
  {
    "content": "We will be remembered only if we give to our younger generation a prosperous and safe India, resulting out of economic prosperity coupled with civilizational heritage.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There is a field beyond all notions of right and wrong. Come, meet me there.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Even The Darkest Night Will End And The Sun Will Rise.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Feet, What Do I Need You For When I Have Wings To Fly?",
    "author": "Frida Kahlo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Whoever Would Overthrow The Liberty Of A Nation Must Begin By Subduing The Freeness Of Speech.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Spread Love Everywhere You Go. Let No One Ever Come To You Without Leaving Happier.",
    "author": "Mother Teresa",
    "tags": [
      "love"
    ]
  },
  {
    "content": "One of the very important characteristics of a student is to question. Let the students ask questions.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To fight against the infidels is Jihad; but to fight against your evil self is greater Jihad.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "At home I am a nice guy: but I don't want the world to know. Humble people, I've found, don't get very far.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "May Allah bless the man who says less and does more.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "My place is placeless, a trace of the traceless.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Success Is Not Final, Failure Is Not Fatal: It Is The Courage To Continue That Counts.",
    "author": "Winston Churchill",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Plants And Minerals Are Bound To Predestination. The Faithful Is Only Bound To The Divine Orders.",
    "author": "Muhammad Iqbal",
    "tags": [
      "general"
    ]
  },
  {
    "content": "As We Express Our Gratitude, We Must Never Forget That The Highest Appreciation Is Not To Utter Words, But To Live By Them.",
    "author": "John F. Kennedy",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Death is the easiest of all things after it, and the hardest of all things before it.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "When In Doubt, Go For The Dick Joke.",
    "author": "Robin Williams",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Do Not Think Much Of A Man Who Is Not Wiser Today Than He Was Yesterday.",
    "author": "Abraham Lincoln",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don'T Be Distracted By Criticism. Remember ~ The Only Taste Of Success Some People Have Is When They Take A Bite Out Of You.",
    "author": "Zig Ziglar",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Words are a pretext. It is the inner bond that draws one person to another, not words.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Where There Is No Struggle, There Is No Strength.",
    "author": "Oprah Winfrey",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Function Of Muscle Is To Pull And Not To Push, Except In The Case Of The Genitals And The Tongue.",
    "author": "Leonardo Da Vinci",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Through love, all pain will turn to medicine.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Allah will help him who moves in the way of Allah.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do Not Be Embarrassed By Your Failures, Learn From Them And Start Again.",
    "author": "Richard Branson",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "I know where I'm going and I know the truth, and I don't have to be what you want me to be. I'm free to be what I want.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who prays five times a day is in the protection of God, and he who is protected by God cannot be harmed by anyone.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Find Hope In The Darkest Of Days, And Focus In The Brightest. I Do Not Judge The Universe.",
    "author": "Dalai Lama",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The wisest among you is he whose sustenance is the fear of Allah.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Because I cannot sleep I make music in the night.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Strive Not To Be A Success, But Rather To Be Of Value.",
    "author": "Albert Einstein",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "If You Tell The Truth, You Don'T Have To Remember Anything.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Disneyland Will Never Be Completed. It Will Continue To Grow As Long As There Is Imagination Left In The World.",
    "author": "Walt Disney",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If You Have Good Thoughts They Will Shine Out Of Your Face Like Sunbeams And You Will Always Look Lovely.",
    "author": "Roald Dahl",
    "tags": [
      "love"
    ]
  },
  {
    "content": "If you wish to be a mine of jewels, open the deep ocean within your heart.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Let me alone, and go in search of someone else.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A True friend is one who sees a fault, gives you advice and who defends you in your absence.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You Can Tell Whether A Man Is Clever By His Answers. You Can Tell Whether A Man Is Wise By His Questions.",
    "author": "Naguib Mahfouz",
    "tags": [
      "general"
    ]
  },
  {
    "content": "No One Changes The World Who Isn'T Obsessed.",
    "author": "Billie Jean King",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The best deed of a great man is to forgive and forget.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "One May Sometimes Tell A Lie, But The Grimace That Accompanies It Tells The Truth.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do not hate what you do not know, for the greater part of knowledge consists of what you do not know.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "Love Begins At Home, And It Is Not How Much We Do... But How Much Love We Put In That Action.",
    "author": "Mother Teresa",
    "tags": [
      "love"
    ]
  },
  {
    "content": "My Religion Is Very Simple. My Religion Is Kindness.",
    "author": "Dalai Lama",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There are forces in life working for you and against you. One must distinguish the beneficial forces from the malevolent ones and choose correctly between them.",
    "author": "Abdul Kalam",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Beware Of Little Expenses. A Small Leak Will Sink A Great Ship.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All My Life Through, The New Sights Of Nature Made Me Rejoice Like A Child.",
    "author": "Marie Curie",
    "tags": [
      "life"
    ]
  },
  {
    "content": "He who indulges in falsehood will find the paths of paradise shut to him.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Man Is Descended From A Hairy, Tailed Quadruped, Probably Arboreal In Its Habits.",
    "author": "Charles Darwin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The minute I heard my first love story, I started looking for you.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "People of the world don't look at themselves, and so they blame one another.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Truth. It Is A Beautiful And Terrible Thing, And Must Therefore Be Treated With Great Caution.",
    "author": "J. K. Rowling",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Object Of The Superior Man Is Truth.",
    "author": "Confucius",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Live amongst people in such a manner that if you die they weep over you and if you are alive they crave for your company.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Pride In The Case Of A Rich Man Is Bad, But Pride In The Case Of A Poor Man Is Worse.",
    "author": "Abu Bakr",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Tell Me And I Forget. Teach Me And I Remember. Involve Me And I Learn.",
    "author": "Benjamin Franklin",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "Why Is It That We Rejoice At A Birth And Grieve At A Funeral? It Is Because We Are Not The Person Involved.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If You Have A Particular Faith Or Religion, That Is Good. But You Can Survive Without It.",
    "author": "Dalai Lama",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You don't want no pie in the sky when you die, You want something here on the ground while you're still around.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't be satisfied with stories, how things have gone with others. Unfold your own myth.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Purify your eyes, and see the pure world. Your life will fill with radiant forms.",
    "author": "Rumi",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Associating with the wise and the knowledgeable people adds to the prestige of a person.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "There Is No Darkness But Ignorance.",
    "author": "William Shakespeare",
    "tags": [
      "general"
    ]
  },
  {
    "content": "All Great Achievements Require Time.",
    "author": "Maya Angelou",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "One Does Not Leave A Convivial Party Before Closing Time.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "You Are Not Only Responsible For What You Say, But Also For What You Do Not Say.",
    "author": "Martin Luther",
    "tags": [
      "general"
    ]
  },
  {
    "content": "So Go Ahead. Fall Down. The World Looks Different From The Ground.",
    "author": "Oprah Winfrey",
    "tags": [
      "general"
    ]
  },
  {
    "content": "When We Lose One Blessing, Another Is Often Most Unexpectedly Given In Its Place.",
    "author": "C. S. Lewis",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Intelligence Is The Wife, Imagination Is The Mistress, Memory Is The Servant.",
    "author": "Victor Hugo",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It is a matter of shame that in the morning the birds should be awake earlier than you.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "What Doesn'T Kill Us Makes Us Stronger.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The weakest man is the one who is able to correct his moral defects, but doesn't take action.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I Do Not Need The Idea Of God To Explain The World I Live In.",
    "author": "Salman Rushdie",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The highest person is he who is of most use to humankind.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Common Sense Is The Collection Of Prejudices Acquired By Age Eighteen.",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do not let your difficulties fill you with anxiety, after all it is only in the darkest nights that stars shine more brightly.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Preserve the sayings of those people who are indifferent to the world. They say only that what Allah wishes them to say.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I hated every minute of training, but I said, “Don't quit. Suffer now and live the rest of your life as a champion.”",
    "author": "Muhammad Ali",
    "tags": [
      "life"
    ]
  },
  {
    "content": "The Only Way To Do News On Television Is Not To Be Terrified Of It.",
    "author": "David Brinkley",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Is A Mistake To Look Too Far Ahead. Only One Link Of The Chain Of Destiny Can Be Handled At A Time.",
    "author": "Winston Churchill",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I'll destroy you. I am the master of disaster.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I fear the day when the Kuffar are proud of their falsehood, and the Muslims are shy of their faith.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Is From Books That Wise People Derive Consolation In The Troubles Of Life.",
    "author": "Victor Hugo",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Take Things As They Are. Punch When You Have To Punch. Kick When You Have To Kick.",
    "author": "Bruce Lee",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do not overeat; that invites disease.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Denial Ain'T Just A River In Egypt.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Life Well Spent Is Long.",
    "author": "Leonardo Da Vinci",
    "tags": [
      "life"
    ]
  },
  {
    "content": "Love is the bridge between you and everything.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Be patient where you sit in the dark. The dawn is coming.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Often It Does Seem A Pity That Noah And His Party Did Not Miss The Boat.",
    "author": "Mark Twain",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A heart filled with love is like a phoenix that no cage can imprison.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "No boxer in the history of boxing has had Parkinson's. There's no injury in my brain that suggests that the illness came from boxing.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He Who Is Fixed To A Star Does Not Change His Mind.",
    "author": "Leonardo Da Vinci",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Imagination Will Often Carry Us To Worlds That Never Were. But Without It We Go Nowhere.",
    "author": "Carl Sagan",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Nothing Good Ever Comes Of Violence.",
    "author": "Martin Luther",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If Light Is In Your Heart You Will Find Your Way Home.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "To Be A Christian Means To Forgive The Inexcusable Because God Has Forgiven The Inexcusable In You.",
    "author": "C. S. Lewis",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't forget your own self while preaching to others.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "If That'S There, I Believe That Technology Will Probably Step Up To Their Part Of It.",
    "author": "Neil Armstrong",
    "tags": [
      "inspirational",
      "technology"
    ]
  },
  {
    "content": "Creativity is the key to success in the future, and primary education is where teachers can bring creativity in children at that level.",
    "author": "Abdul Kalam",
    "tags": [
      "inspirational",
      "wisdom"
    ]
  },
  {
    "content": "If they can make penicillin out of moldy bread, then they can sure make something out of you.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Thoughts Are The Shadows Of Our Feelings - Always Darker, Emptier And Simpler.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "It Is The Supreme Art Of The Teacher To Awaken Joy In Creative Expression And Knowledge.",
    "author": "Albert Einstein",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "He who does not live in the way of his beliefs starts to believe in the way he lives.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "We should not give up and we should not allow the problem to defeat us.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Failure Is Not The Opposite Of Success; It'S Part Of Success.",
    "author": "Arianna Huffington",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "Where there is ruin, there is hope for a treasure.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Risk Comes From Not Knowing What You'Re Doing.",
    "author": "Warren Buffett",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do not be too hard, lest you be broken; do not be too soft, lest you be squeezed.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Champions come and go, but to be legendary you got to have heart, more heart than the next man, more than anyone in the world.",
    "author": "Muhammad Ali",
    "tags": [
      "love"
    ]
  },
  {
    "content": "It Is Normal To Give Away A Little Of One'S Life In Order Not To Lose It All.",
    "author": "Albert Camus",
    "tags": [
      "life"
    ]
  },
  {
    "content": "What is politics? Political system is equal to development politics plus political politics.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I don't count my situps. I only start counting once it starts hurting.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "How could they say that my religion, Islam was a 'race hate' religion after all the plunder and enslavement and domination of my people by white Christians in the name of white supremacy?",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "To make one good action succeed another, is the perfection of goodness.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Loving one another is half of wisdom.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "There is no harm in patience, and no profit in lamentation. Death is easier to bear (than) that which precedes it, and more severe than that which comes after it. Remember the death of the Apostle of God, and your sorrow will be lessened.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "At Twenty Years Of Age The Will Reigns; At Thirty, The Wit; And At Forty, The Judgment.",
    "author": "Benjamin Franklin",
    "tags": [
      "general"
    ]
  },
  {
    "content": "We can't be brave without fear.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Morality Is The Herd-Instinct In The Individual.",
    "author": "Friedrich Nietzsche",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Truly great people in history never wanted to be great for themselves. All they wanted was the chance to do good for others and be close to God.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Will To Win, The Desire To Succeed, The Urge To Reach Your Full Potential... These Are The Keys That Will Unlock The Door To Personal Excellence.",
    "author": "Confucius",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The Earth is the most powerful and energetic planet.",
    "author": "Abdul Kalam",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Never explain yourself to anyone, because the one who likes you would not need it, and the one dislikes you wouldn't believe it.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "inspirational"
    ]
  },
  {
    "content": "People Say Satire Is Dead. It'S Not Dead; It'S Alive And Living In The White House.",
    "author": "Robin Williams",
    "tags": [
      "life"
    ]
  },
  {
    "content": "If my mind can conceive it, and my heart can believe it, then I can achieve it.",
    "author": "Muhammad Ali",
    "tags": [
      "inspirational",
      "love"
    ]
  },
  {
    "content": "A Question That Sometimes Drives Me Hazy: Am I Or Are The Others Crazy?",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "He who busies himself with things other than improvement of his own self becomes perplexed in darkness and entangled in ruin. His evil spirits immerse him deep in vices and make his bad actions seem handsome.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Impossible is nothing.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "In the matter of justice, all should be equal in your eyes.",
    "author": "Abu Bakr (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A Well-Spent Day Brings Happy Sleep.",
    "author": "Leonardo Da Vinci",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Don't engage your heart in grief over the past or you wont be ready for what is coming.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Two things cause people to be destroyed: fear of poverty and seeking superiority through pride.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "When a man says I cannot, he has made a suggestion to himself. He has weakened his power of accomplishing that which otherwise would have been accomplished.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Your Most Unhappy Customers Are Your Greatest Source Of Learning.",
    "author": "Bill Gates",
    "tags": [
      "wisdom"
    ]
  },
  {
    "content": "Thinking should become your capital asset, no matter whatever ups and downs you come across in your life.",
    "author": "Abdul Kalam",
    "tags": [
      "life"
    ]
  },
  {
    "content": "I'm the best. I just haven't played yet.",
    "author": "Muhammad Ali",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Your worst enemy is hiding within yourself, and that enemy is your nafs or false ego.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Do not put off today's work for tomorrow.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Things Won Are Done, Joy'S Soul Lies In The Doing.",
    "author": "William Shakespeare",
    "tags": [
      "general"
    ]
  },
  {
    "content": "In Order To Be An Immaculate Member Of A Flock Of Sheep, One Must Above All Be A Sheep Oneself.",
    "author": "Albert Einstein",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I'Ve Learned That Making A 'Living' Is Not The Same Thing As 'Making A Life'.",
    "author": "Maya Angelou",
    "tags": [
      "life",
      "wisdom"
    ]
  },
  {
    "content": "What hurts you, blesses you. Darkness is your candle.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The one who has no control over his desires has no control over his mind.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "A moment of patience in a moment of anger prevents a thousand moments of regret.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Man comes from a drop of semen and leaves as a piece of dust. He doesn't know when he came and he doesn't know when he's leaving, yet he walks on the earth thinking he knows everything.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I searched for God and found only myself. I searched for myself and found only God.",
    "author": "Rumi",
    "tags": [
      "general"
    ]
  },
  {
    "content": "There Are Two Sides To Every Issue: One Side Is Right And The Other Is Wrong, But The Middle Is Always Evil.",
    "author": "Ayn Rand",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Listen with ears of tolerance! See through the eyes of compassion! Speak with the language of love.",
    "author": "Rumi",
    "tags": [
      "love"
    ]
  },
  {
    "content": "Let Me Alone, And Go In Search Of Someone Else.",
    "author": "Ali Ibn Abi Talib",
    "tags": [
      "general"
    ]
  },
  {
    "content": "Dislike in yourself what you dislike in others.",
    "author": "Ali ibn Abi Talib (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "People Ask The Difference Between A Leader And A Boss. The Leader Leads, And The Boss Drives.",
    "author": "Theodore Roosevelt",
    "tags": [
      "general"
    ]
  },
  {
    "content": "The wisest man is he who can account for his actions.",
    "author": "Umar ibn Al-Khattāb (R.A)",
    "tags": [
      "general"
    ]
  },
  {
    "content": "I'M Not Even Kind Of A Lesbian.",
    "author": "Oprah Winfrey",
    "tags": [
      "general"
    ]
  }
]