Repository: Alex-Unnippillil/kali-linux-portfolio
Catalog: po/*.po
Languages: de, es, fr, pt, zh_cn

source: Usual Applications
de: Übliche Anwendungen
es: Aplicaciones habituales
fr: Applications habituelles
pt: Aplicações habituais
zh_cn: 常用程序

source: 01 - Reconnaissance
de: 01 - Erkennung
es: 01 - Reconocimiento
pt: 01 - Reconhecimento
zh_cn: 01 - 侦察

source: • Identity Information
de: • Identitätsinformationen
es: • Información de Identidad
fr: • Informations d'identité
pt: • Informações de Identidade
zh_cn: • 身份信息

source: • Network Information
de: • Netzwerk-Informationen
es: • Información de Red
fr: • Informations sur le réseau
pt: • Informações de Rede
zh_cn: • 网络信息

source: • Web Scanning
de: • Web-Scannen
es: • Escaneo Web
fr: • Analyse Web
pt: • Varredura Web
zh_cn: • 网络扫描

source: • Web Vulnerability Scanning
de: • Web-Schwachstellen-Scannen
es: • Escaneo de Vulnerabilidades Web
fr: • Analyse de Vulnérabilités Web
pt: • Varredura de Vulnerabilidades Web
zh_cn: • Web 漏洞扫描

source: 03 - Initial Access
de: 03 - Erster Zugriff
es: 03 - Acceso Inicial
fr: 03 - Accès Initial
pt: 03 - Acesso Inicial
zh_cn: 03 - 初始访问

source: 04 - Execution
de: 04 - Ausführung
es: 04 - Ejecución
fr: 04 - Exécution
pt: 04 - Execução
zh_cn: 04 - 执行

source: 06 - Privilege Escalation
de: 06 - Privilegien Erweiterung
es: 06 - Escalada de Privilegios
fr: 06 - Escalade de Privilèges
pt: 06 - Elevação de Privilégios
zh_cn: 06 - 权限提升

source: 08 - Credential Access
de: 08 - Zugriff auf Zugangsdaten
es: 08 - Acceso a Credenciales
fr: 08 - Accès aux Identifiants
pt: 08 - Acesso a Credenciais
zh_cn: 08 - 凭证访问

source: • OS Credential Dumping
de: • Betriebssystem-Zugangsdatenextraktion
es: • Extracción de Credenciales del SO
fr: • Dumping des identifiants du OS
pt: • Extração de Credenciais do SO
zh_cn: • 操作系统凭据转储

source: • Brute Force
de: • Brute-Force-Angriff
es: • Fuerza Bruta
fr: • Attaque par force brute
pt: • Força Bruta
zh_cn: • 暴力破解

source: • Password Cracking
de: • Passwort-Knacken
es: • Descifrado de Contraseñas
fr: • Craquage de Mots de Passe
pt: • Quebra de Senhas
zh_cn: • 破解密码

source: 09 - Discovery
de: 09 - Entdeckung
es: 09 - Descubrimiento
fr: 09 - Découverte
pt: 09 - Descoberta
zh_cn: 09 - 发现

source: • Network Service Discovery
de: • Netzwerkdienst-Erkennung
es: • Descubrimiento de Servicios de Red
fr: • Découverte de Services Réseau
pt: • Descoberta de Serviços de Rede
zh_cn: • 网络服务发现

source: • Network Sniffing
de: • Netzwerk-Sniffing
es: • Sniffing de Red
fr: • Sniffing de Réseau
pt: • Sniffing de Rede
zh_cn: • 网络嗅探

source: 11 - Collection
de: 11 - Sammlung
es: 11 - Recopilación
fr: 11 - Collecte
pt: 11 - Coleta
zh_cn: 11 - 收集

source: 12 - Command and Control
de: 12 - Befehl und Kontrolle
es: 12 - Comando y Control
fr: 12 - Commandement et Contrôle
pt: 12 - Comando e Controle
zh_cn: 12 - 指挥控制

source: • Non-Application Layer Protocol
de: • Nicht-Anwendungsschicht-Protokoll
es: • Protocolo fuera de Capa de Aplicación
fr: • Protocole Non-Couche Application
pt: • Protocolo fora da camada de aplicação
zh_cn: • 非应用层协议

source: 13 - Exfiltration
es: 13 - Exfiltración
pt: 13 - Exfiltração
zh_cn: 13 - 渗漏

source: 15 - Forensics
de: 15 - Forensik
es: 15 - Análisis forense
fr: 15 - Criminalistique
pt: 15 - Análise forense
zh_cn: 15 - 数字取证

source: • Digital Forensics
de: • Digitale Forensik
es: • Análisis forense digital
fr: • Criminalistique Numérique
pt: • Análise forense digital
zh_cn: • 数字取证

source: • Sleuth Kit Suite
de: • Forensik-Werkzeugsammlungen
es: • Kits de forensia
fr: • Suites Criminalistique
pt: • Kits forenses
zh_cn: • 数字取证套件
