[
  {
    "id": "dump",
    "title": "LSASS Memory Capture (Sanitized)",
    "summary": "Synthesized from public Mimikatz training walk-throughs showing how logonpasswords exposes cached secrets. All secrets are sanitized or well-known sentinels.",
    "records": [
      {
        "account": "ACME\\Administrator",
        "artifact": "NTLM hash",
        "secret": "31d6cfe0d16ae931b73c59d7e0c089c0",
        "context": "Interactive logon for the default administrator account.",
        "explanation": "Hash corresponds to the blank-password sentinel often highlighted in incident response labs to confirm an account was disabled or left without a password."
      },
      {
        "account": "ACME\\backupsvc",
        "artifact": "Clear-text credential",
        "secret": "S@mpl3B@ckup!",
        "context": "Service account scheduled for nightly database exports.",
        "explanation": "Synthetic password illustrates why operational service accounts should use managed secrets or gMSA instead of static strings."
      },
      {
        "account": "ACME\\sqlops",
        "artifact": "Kerberos key material",
        "secret": "aes256_hmac(sha1):1f9a7c1d2b8c9e0f1112131415161718",
        "context": "SQL operator service configured for constrained delegation.",
        "explanation": "Key bytes truncated from Microsoft workshop examples to show how AES keys appear when exported for offline cracking practice."
      }
    ]
  },
  {
    "id": "tokens",
    "title": "Token Cache Review",
    "summary": "Highlights delegated and impersonation tokens that simulated attackers frequently replay. Values are shortened hexadecimal strings, not live handles.",
    "records": [
      {
        "account": "ACME\\alice",
        "artifact": "Delegation token",
        "secret": "0x0000000000ABCDEF00112233",
        "context": "Helpdesk analyst with temporary domain admin elevation.",
        "explanation": "Hex blob trimmed from pass-the-token labs to demonstrate why privileged sessions should be short lived and monitored."
      },
      {
        "account": "ACME\\svc-web",
        "artifact": "Impersonation token",
        "secret": "0x00000000004567AC0099DD10",
        "context": "IIS application pool identity servicing intranet portals.",
        "explanation": "Shows how web tier identities inherit user context and why IIS hardening guides recommend isolating pools."
      }
    ]
  },
  {
    "id": "tickets",
    "title": "Kerberos Ticket Cache",
    "summary": "Sample Kerberos material taken from red-team lab environments with hostnames anonymized.",
    "records": [
      {
        "account": "ACME.LOCAL\\krbtgt",
        "artifact": "TGT (base64)",
        "secret": "doIFhDCCBYCgAwIBBaEDAgEWooIE+TCCBPVhggTxMIIF7QYLKoZIhvcNAQ...",
        "context": "Golden ticket example using anonymized realm identifiers.",
        "explanation": "Snippet demonstrates the long-lived nature of forged TGTs without distributing a full usable ticket."
      },
      {
        "account": "ACME\\sqlsvc",
        "artifact": "Service ticket",
        "secret": "0x6d6573736167652d7369676e6564",
        "context": "SPN: MSSQLSvc/sql01.acme.local:1433",
        "explanation": "Hex digest mirrors kerberoasting tutorials and underlines why SPN accounts require strong, rotated credentials."
      }
    ]
  }
]
